Repository: axento/Infinite-CMS
Catalog: application/configs/contact.tmx
Source language: en
Languages: fr, nl

source: Contact us
fr: Contactez-nous
nl: Contacteer ons

source: Find us
fr: Contactez-nous
nl: Ons adres

source: Your name
fr: Nom
nl: Uw naam

source: Your E-mail address
fr: Adresse e-amail
nl: Uw e-mailadres

source: Your phone number
fr: Téléphone
nl: Uw telefoonnummer

source: Question / Comment
fr: Question / Commentaire
nl: Uw boodschap

source: Send a copy to myself
fr: Question / Commentaire
nl: Zend een kopie naar mezelf

source: Enter name
fr: Nom
nl: Vul uw naam in

source: Enter E-mail
fr: Adresse e-amail
nl: Vul uw e-mailadres in

source: Enter phone number
fr: Téléphone
nl: Vul uw telefoonnummer in

source: Enter message
fr: Question / Commentaire
nl: Vul uw boodschap in

source: Send
fr: Envoyer
nl: Verzenden
